% 右手四元数转坐标，四元数按照虚拟动力骨骼绑定规范排布，20*4
% QuatF ： 输入的四元数矩阵，20*4
% root ： 输入的根节点坐标，1*3
% bone ： 输入的右手初始骨骼坐标，按照虚拟动力骨骼绑定规范制作，20*3
% pos ： 输出的手部关节坐标，按照虚拟动力骨骼绑定规范排布，20*3
% pos_end ： 输出的手指末端节点坐标，5*3
% isFigure ： true就是画一下图
function [pos,pos_end]=Quat2PositionRHand(QuatF,root,bone,isFigure)
if ~exist('bone', 'var') || isempty(bone)
    bone=[0.748310000000000,	0,	1.59686000000000,
		0.782100000000000,	0.0423500000000000,	1.59686000000000,
		0.817540000000000,	0.0776100000000000,	1.59686000000000,
		0.842020000000000,	0.102230000000000,	1.59686000000000,
		0.792070000000000,	0.0268500000000000,	1.59686000000000,
		0.862930000000000,	0.0404100000000000,	1.59686000000000,
		0.912000000000000,	0.0404100000000000,	1.59686000000000,
		0.939790000000000,	0.0404100000000000,	1.59686000000000,
		0.794240000000000,	0.0102700000000000,	1.59686000000000,
		0.864460000000000,	0.0145400000000000,	1.59686000000000,
		0.917950000000000,	0.0145400000000000,	1.59686000000000,
		0.951440000000000,	0.0145400000000000,	1.59686000000000,
		0.793990000000000, -0.0017500000000000,1.59686000000000,
		0.856940000000000, -0.0082800000000000,1.59686000000000,
		0.903520000000000, -0.0082800000000000,1.59686000000000,
		0.935850000000000, -0.0082800000000000,1.59686000000000,
		0.791230000000000, -0.0163000000000000,1.59686000000000,
		0.847410000000000, -0.0311000000000000,1.59686000000000,
		0.884770000000000, -0.0311000000000000,1.59686000000000,
		0.908340000000000, -0.0311000000000000,1.59686000000000,];
end
if ~exist('root', 'var') || isempty(root)
    root=bone(1,:);
end
if ~exist('isFigure', 'var') || isempty(isFigure)
    isFigure=1;
end
FN = [ 0,0,1,2,0,4,5,6,0,8,9,10,0,12,13,14,0,16,17,18]+1;
boneVer=bone(1:20,:)-bone(FN,:);
pos=ones(size(bone,1),1)*root;
for jj=2:20
    qt=QuatF(FN(jj),:);
    pos(jj,:)=boneVer(jj,:)*T_SY(qt)'+pos(FN(jj),:);
end
% 构造手指末端的初始骨骼向量
boneVer_end=[(bone(4,:)-bone(3,:))*0.8;(bone(8,:)-bone(7,:))*0.8;(bone(12,:)-bone(11,:))*0.8;(bone(16,:)-bone(15,:))*0.8;(bone(20,:)-bone(19,:))*0.8];
pos_end=zeros(5,3);
EndQuatList=[4,8,12,16,20];
for jj=1:5
    qt=QuatF(EndQuatList(jj),:);
    pos_end(jj,:)=boneVer_end(jj,:)*T_SY(qt)'+pos(EndQuatList(jj),:);
end
if isFigure
    handline1=[1,2,3,4];
    handline2=[1,5,6,7,8];
    handline3=[1,9,10,11,12];
    handline4=[1,13,14,15,16];
    handline5=[1,17,18,19,20];
    figure;
    hold on;
    Plot3Line([pos(handline1,:);pos_end(1,:)],'-*');
    Plot3Line([pos(handline2,:);pos_end(2,:)],'-*');
    Plot3Line([pos(handline3,:);pos_end(3,:)],'-*');
    Plot3Line([pos(handline4,:);pos_end(4,:)],'-*');
    Plot3Line([pos(handline5,:);pos_end(5,:)],'-*');
end